#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

module.lambda.data.archive_file.lambda: Reading...
module.lambda.data.archive_file.lambda: Read complete after 0s [id=961df6c7267b298a2f7d86250a5bbc5f4263c442]
module.ecs.data.aws_iam_policy_document.task_exec_assume: Reading...
module.ecs.aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:us-west-2:834794241069:cluster/soat1-grp13-hackaton]
module.secrets.aws_secretsmanager_secret.produto: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:834794241069:secret:ponto-secret-NB4j4e]
module.networking.aws_vpc.vpc: Refreshing state... [id=vpc-0db404267d7139abd]
module.apigw.aws_apigatewayv2_api.apigw_http_endpoint: Refreshing state... [id=twp34lyeef]
module.secrets.aws_secretsmanager_secret.producao: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:834794241069:secret:relatorio-secret-9tZpV9]
module.lambda.aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
module.secrets.aws_secretsmanager_secret.auth: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:834794241069:secret:auth-secret-OJtrzQ]
module.s3.aws_s3_bucket.lambda_s3: Refreshing state... [id=tech-challenge-soat1-grp13-s3-auth]
module.databases.aws_dynamodb_table.loggedUsers: Refreshing state... [id=usuariosLogados]
module.ecs.data.aws_iam_policy_document.task_exec_assume: Read complete after 0s [id=2291109037]
module.ecs.aws_iam_role.task_exec: Refreshing state... [id=taskRole]
module.ecs.aws_ecs_task_definition.relatorio: Refreshing state... [id=relatorio-api]
module.ecs.aws_iam_role_policy_attachment.default: Refreshing state... [id=taskRole-20240323013206539300000004]
module.ecs.aws_ecs_task_definition.rabbitMQ: Refreshing state... [id=rabbitmq-api]
module.ecs.aws_ecs_task_definition.auth: Refreshing state... [id=hackaton-auth-api]
module.ecs.aws_ecs_task_definition.ponto: Refreshing state... [id=ponto-api]
module.lambda.aws_lambda_function.authorizer_lambda: Refreshing state... [id=techChallenge-authorizer]
module.apigw.aws_apigatewayv2_stage.apigw_stage: Refreshing state... [id=$default]
module.ecs.aws_cloudwatch_log_group.this: Refreshing state... [id=/aws/ecs/soat1-grp13-hackaton]
module.ecs.aws_ecs_cluster_capacity_providers.this: Refreshing state... [id=soat1-grp13-hackaton]
module.ecs.data.aws_iam_policy_document.task_exec: Reading...
module.ecs.data.aws_iam_policy_document.task_exec: Read complete after 0s [id=2255285640]
module.ecs.aws_iam_policy.policy: Refreshing state... [id=arn:aws:iam::834794241069:policy/getSecretELog]
module.ecs.aws_iam_role_policy_attachment.task_exec_additional: Refreshing state... [id=taskRole-20240323013215670800000005]
module.apigw.aws_lambda_permission.my_authorizer_lambda_permission: Refreshing state... [id=AllowAPIGatewayInvoke]
module.apigw.aws_apigatewayv2_authorizer.apigw_authorizer: Refreshing state... [id=nlp7c1]
module.networking.aws_route_table.private: Refreshing state... [id=rtb-0216a182574c9df54]
module.ecs.aws_security_group.ecs_sg: Refreshing state... [id=sg-033707f3b79e8b529]
module.networking.aws_subnet.public_subnet[0]: Refreshing state... [id=subnet-0d7157e644032085b]
module.networking.aws_route_table.public: Refreshing state... [id=rtb-079a1c96965ec6cff]
module.networking.aws_internet_gateway.ig: Refreshing state... [id=igw-02bdb5d28cc4076b9]
module.networking.aws_subnet.private_subnet[1]: Refreshing state... [id=subnet-026752a12bf1ec42d]
module.alb.aws_security_group.egress_all: Refreshing state... [id=sg-0b064e5df918cfcac]
module.networking.aws_subnet.private_subnet[0]: Refreshing state... [id=subnet-0c1ae5565654d0e49]
module.networking.aws_subnet.public_subnet[1]: Refreshing state... [id=subnet-04ff3e2729737188c]
module.alb.aws_security_group.https: Refreshing state... [id=sg-0ea6da8633960c774]
module.alb.aws_security_group.ingress_api: Refreshing state... [id=sg-0782911290d4e93f1]
module.networking.aws_security_group.tech_challenge_sg: Refreshing state... [id=sg-0fecbecdc25e9663c]
module.alb.aws_security_group.http: Refreshing state... [id=sg-057ac8be7d34a7500]
module.networking.aws_eip.nat_eip: Refreshing state... [id=eipalloc-0a9c38c34291e129b]
module.networking.aws_route.public_internet_gateway: Refreshing state... [id=r-rtb-079a1c96965ec6cff1080289494]
module.databases.aws_security_group.rds-postgres-sg: Refreshing state... [id=sg-00a119c004eb59a7a]
module.networking.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0378029b88aaa426b]
module.networking.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-03eaf625ad7faee28]
module.networking.aws_db_subnet_group.db_subnet: Refreshing state... [id=db_subnet_group]
module.networking.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0af0fdd5eafb75acb]
module.networking.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-057bdda2a602f1b3b]
module.apigw.aws_apigatewayv2_vpc_link.vpclink_apigw_to_alb: Refreshing state... [id=06lwns]
module.alb.aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:834794241069:loadbalancer/app/hackatonsoat1grp13alb/34facade9c8fb7e8]
module.networking.aws_nat_gateway.nat: Refreshing state... [id=nat-0cac6133e3e502f50]
module.networking.aws_route.private_nat_gateway: Refreshing state... [id=r-rtb-0216a182574c9df541080289494]
module.alb.aws_lb_target_group.auth: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:834794241069:targetgroup/auth-tg/5cc2675423906c48]
module.alb.aws_lb_target_group.rabbitmq: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:834794241069:targetgroup/rabbitmq-tg/1229654cc3e9ab51]
module.alb.aws_lb_target_group.rabbitqmq_management: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:834794241069:targetgroup/rabbitqmq-management-tg/d2f452461558a9dc]
module.alb.aws_lb_target_group.ponto: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:834794241069:targetgroup/ponto-tg/eeb5e7782fd622e6]
module.alb.aws_lb_target_group.relatorio: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:834794241069:targetgroup/relatorio-tg/0fa2cbae0c113e30]
module.databases.aws_db_instance.postgresql_db: Refreshing state... [id=db-UMQZMZXWUMXQZ4NP6Q5J5YW7RM]
module.databases.aws_db_instance.replica-postgresql-rds: Refreshing state... [id=db-6POCJQRTGTAM3ZFIBJIYIR55QM]
module.alb.aws_lb_listener.rabbit: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:834794241069:listener/app/hackatonsoat1grp13alb/34facade9c8fb7e8/9070bb4926a3b2ed]
module.alb.aws_lb_listener.this: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:834794241069:listener/app/hackatonsoat1grp13alb/34facade9c8fb7e8/15b9c5a863ce0a05]
module.ecs.aws_ecs_service.auth: Refreshing state... [id=arn:aws:ecs:us-west-2:834794241069:service/soat1-grp13-hackaton/auth-service]
module.ecs.aws_ecs_service.rabbitmq: Refreshing state... [id=arn:aws:ecs:us-west-2:834794241069:service/soat1-grp13-hackaton/rabbitmq-service]
module.ecs.aws_ecs_service.ponto: Refreshing state... [id=arn:aws:ecs:us-west-2:834794241069:service/soat1-grp13-hackaton/ponto-service]
module.ecs.aws_ecs_service.relatorio: Refreshing state... [id=arn:aws:ecs:us-west-2:834794241069:service/soat1-grp13-hackaton/relatorio-service]
module.ecs.aws_appautoscaling_target.dev_to_target: Refreshing state... [id=service/soat1-grp13-hackaton/ponto-service]
module.alb.aws_lb_listener_rule.auth: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:834794241069:listener-rule/app/hackatonsoat1grp13alb/34facade9c8fb7e8/15b9c5a863ce0a05/89c256bc8e94c7c4]
module.apigw.aws_apigatewayv2_integration.apigw_integration: Refreshing state... [id=8e7nur8]
module.alb.aws_lb_listener_rule.rabbitqmq_management: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:834794241069:listener-rule/app/hackatonsoat1grp13alb/34facade9c8fb7e8/15b9c5a863ce0a05/8182fdf7f68cdb14]
module.alb.aws_lb_listener_rule.ponto: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:834794241069:listener-rule/app/hackatonsoat1grp13alb/34facade9c8fb7e8/15b9c5a863ce0a05/6d82be54f6bf317c]
module.alb.aws_lb_listener_rule.relatorio: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:834794241069:listener-rule/app/hackatonsoat1grp13alb/34facade9c8fb7e8/15b9c5a863ce0a05/d4d09032b6b696a8]
module.apigw.aws_apigatewayv2_route.auth_route: Refreshing state... [id=3o0zm81]
module.apigw.aws_apigatewayv2_route.relatorio_route: Refreshing state... [id=r57ip7d]
module.apigw.aws_apigatewayv2_route.ponto_route: Refreshing state... [id=s1k7ptd]
module.apigw.aws_apigatewayv2_route.rabbit_route: Refreshing state... [id=wi9qrb7]
module.ecs.aws_appautoscaling_policy.dev_to_memory: Refreshing state... [id=dev-to-memory]
module.ecs.aws_appautoscaling_policy.dev_to_cpu: Refreshing state... [id=dev-to-cpu]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_ecs_task_definition.auth must be replaced
-/+ resource "aws_ecs_task_definition" "auth" {
      ~ arn                      = "arn:aws:ecs:us-west-2:834794241069:task-definition/hackaton-auth-api:5" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:834794241069:task-definition/hackaton-auth-api" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu              = 0
                  - environment      = []
                  ~ image            = "christiandmelo/hackathon-soat1-grp13-auth:V1.0.10" -> "christiandmelo/hackathon-soat1-grp13-auth:V1.0.12"
                  - mountPoints      = []
                    name             = "hackaton-auth-api"
                  - systemControls   = []
                  - volumesFrom      = []
                    # (3 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "hackaton-auth-api" -> (known after apply)
      ~ revision                 = 5 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.ecs.aws_ecs_task_definition.ponto must be replaced
-/+ resource "aws_ecs_task_definition" "ponto" {
      ~ arn                      = "arn:aws:ecs:us-west-2:834794241069:task-definition/ponto-api:11" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:834794241069:task-definition/ponto-api" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu              = 0
                  - environment      = []
                  ~ image            = "christiandmelo/hackathon-soat1-grp13-ponto:V1.0.17" -> "christiandmelo/hackathon-soat1-grp13-ponto:V1.0.18"
                  - mountPoints      = []
                    name             = "ponto-api"
                  - systemControls   = []
                  - volumesFrom      = []
                    # (3 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "ponto-api" -> (known after apply)
      ~ revision                 = 11 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.ecs.aws_ecs_task_definition.relatorio must be replaced
-/+ resource "aws_ecs_task_definition" "relatorio" {
      ~ arn                      = "arn:aws:ecs:us-west-2:834794241069:task-definition/relatorio-api:9" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:834794241069:task-definition/relatorio-api" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu              = 0
                  - environment      = []
                  ~ image            = "christiandmelo/hackathon-soat1-grp13-relatorio:V1.0.16" -> "christiandmelo/hackathon-soat1-grp13-relatorio:V1.0.19"
                  - mountPoints      = []
                    name             = "relatorio-api"
                  - systemControls   = []
                  - volumesFrom      = []
                    # (3 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "relatorio-api" -> (known after apply)
      ~ revision                 = 9 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (9 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @luiz-soh, Action: `pull_request`*